testCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    ".*Interface"
    {
        type            cyclicAMI;
    }
    "foil.*"
    {
        type            zeroGradient;
    }
    cosmosRight
    {
	type            zeroGradient;
    }
    cosmosLeft
    {
	type            zeroGradient;
    }
    cosmosInlet
    {
	type            zeroGradient;
    }
    cosmosOutletL
    {
	type            zeroGradient;
    }
    cosmosOutletR
    {
	type            zeroGradient;
    }
    cosmosOutletC
    {
	type            fixedValue;
        value           uniform 0;
    }

}

// ************************************************************************* //
