testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        Euler;
}


gradSchemes
{
default Gauss linear;
}

divSchemes
{
default    	none;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,h)      Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(meshPhi,p)  Gauss limitedLinear 1;
    div(phi,k)      Gauss upwind;
    div(phi,e)      Gauss upwind;
    div(phiv,p)      Gauss upwind;
    div(phiv,e)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div(phi,omega)  Gauss limitedLinear 1;

}


laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}


interpolationSchemes
{
    default         linear;
}


snGradSchemes
{
    default         corrected;
}


fluxRequired
{
    default         no;
    p               ;
    pcorr           ;
}


// ************************************************************************* //
