testCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
 p
    {
        solver           GAMG;

        smoother         GaussSeidel;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
        nPreSweeps       0;
        nPostSweeps      2;

        tolerance       1e-7;
        relTol          0; // 0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-7;
        relTol          0;
    }

    pcorr
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }


    "(rho|U|e|h|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;// 0.1;
    }

    "(rho|U|e|h|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor yes;
    transonic no;
    nOuterCorrectors 1;//3;
    nCorrectors     1;//2;
    nNonOrthogonalCorrectors 1;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.5;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.0;
    pRefCell            0;
    pRefValue           0;

}


relaxationFactors
{
    fields
    {
        p               0.5; // change mid run from 0.5;
    }
    equations
    {
        "(U|k|omega)"   0.5;//0.5;
        "(U|k|omega)Final" 0.5;//0.5;
    }
}



// ************************************************************************* //
